; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c4-s2-p5-a1)

(:domain logistics)

(:objects a0 - airplane
          c0 c1 c2 c3 - city
          t0 t1 t2 t3 t4 t5 - truck
          l0-0 l1-0 l2-0 l3-0 - airport
          l0-1 l1-1 l2-1 l3-1 - location
          p0 p1 p2 p3 p4 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (in-city  l2-0 c2)
    (in-city  l2-1 c2)
    (in-city  l3-0 c3)
    (in-city  l3-1 c3)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l2-1)
    (at t3 l3-1)
    (at t4 l2-1)
    (at t5 l1-0)
    (at p0 l1-1)
    (at p1 l3-0)
    (at p2 l1-1)
    (at p3 l3-1)
    (at p4 l0-1)
    (at a0 l1-0)
)

(:goal
    (and
        (at p0 l3-1)
        (at p1 l2-1)
        (at p2 l0-1)
        (at p3 l0-0)
        (at p4 l0-0)
    )
)
)

; plan
1. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 5
2. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 5
3. (drive t4 l2-1 l2-0)
   deleted: (at t4 l2-1)
   added: (at t4 l2-0)
   goals met: 0 of 5
4. (fly a0 l1-0 l3-0)
   deleted: (at a0 l1-0)
   added: (at a0 l3-0)
   goals met: 0 of 5
5. (load t1 p0 l1-1)
   deleted: (at p0 l1-1)
   added: (in p0 t1)
   goals met: 0 of 5
6. (load t1 p2 l1-1)
   deleted: (at p2 l1-1)
   added: (in p2 t1)
   goals met: 0 of 5
7. (load t3 p3 l3-1)
   deleted: (at p3 l3-1)
   added: (in p3 t3)
   goals met: 0 of 5
8. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 5
9. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 5
10. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 5
11. (drive t4 l2-0 l2-1)
   deleted: (at t4 l2-0)
   added: (at t4 l2-1)
   goals met: 0 of 5
12. (load a0 p1 l3-0)
   deleted: (at p1 l3-0)
   added: (in p1 a0)
   goals met: 0 of 5
13. (unload t1 p0 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 0 of 5
14. (unload t1 p2 l1-0)
   deleted: (in p2 t1)
   added: (at p2 l1-0)
   goals met: 0 of 5
15. (unload t3 p3 l3-0)
   deleted: (in p3 t3)
   added: (at p3 l3-0)
   goals met: 0 of 5
16. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 0 of 5
17. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 5
18. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 5
19. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 5
20. (load a0 p3 l3-0)
   deleted: (at p3 l3-0)
   added: (in p3 a0)
   goals met: 0 of 5
21. (fly a0 l3-0 l1-0)
   deleted: (at a0 l3-0)
   added: (at a0 l1-0)
   goals met: 0 of 5
22. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 5
23. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 5
24. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 0 of 5
25. (load a0 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a0)
   goals met: 0 of 5
26. (load a0 p2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 0 of 5
27. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 5
28. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 5
29. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 5
30. (drive t4 l2-1 l2-0)
   deleted: (at t4 l2-1)
   added: (at t4 l2-0)
   goals met: 0 of 5
31. (drive t5 l1-0 l1-1)
   deleted: (at t5 l1-0)
   added: (at t5 l1-1)
   goals met: 0 of 5
32. (fly a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 0 of 5
33. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 5
34. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 5
35. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 5
36. (unload a0 p1 l2-0)
   deleted: (in p1 a0)
   added: (at p1 l2-0)
   goals met: 0 of 5
37. (fly a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 0 of 5
38. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 5
39. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 5
40. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 0 of 5
41. (drive t4 l2-0 l2-1)
   deleted: (at t4 l2-0)
   added: (at t4 l2-1)
   goals met: 0 of 5
42. (drive t5 l1-1 l1-0)
   deleted: (at t5 l1-1)
   added: (at t5 l1-0)
   goals met: 0 of 5
43. (unload a0 p2 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 0 of 5
44. (fly a0 l0-0 l3-0)
   deleted: (at a0 l0-0)
   added: (at a0 l3-0)
   goals met: 0 of 5
45. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 5
46. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 5
47. (load t0 p4 l0-1)
   deleted: (at p4 l0-1)
   added: (in p4 t0)
   goals met: 0 of 5
48. (unload a0 p0 l3-0)
   deleted: (in p0 a0)
   added: (at p0 l3-0)
   goals met: 0 of 5
49. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 5
50. (fly a0 l3-0 l0-0)
   deleted: (at a0 l3-0)
   added: (at a0 l0-0)
   goals met: 0 of 5
51. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 5
52. (load t0 p2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 0 of 5
53. (load t2 p1 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 t2)
   goals met: 0 of 5
54. (load t3 p0 l3-0)
   deleted: (at p0 l3-0)
   added: (in p0 t3)
   goals met: 0 of 5
55. (unload t0 p4 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 1 of 5
56. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 1 of 5
57. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 1 of 5
58. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 5
59. (drive t4 l2-1 l2-0)
   deleted: (at t4 l2-1)
   added: (at t4 l2-0)
   goals met: 1 of 5
60. (unload a0 p3 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 2 of 5
61. (unload t0 p2 l0-1)
   deleted: (in p2 t0)
   added: (at p2 l0-1)
   goals met: 3 of 5
62. (unload t2 p1 l2-1)
   deleted: (in p1 t2)
   added: (at p1 l2-1)
   goals met: 4 of 5
63. (unload t3 p0 l3-1)
   deleted: (in p0 t3)
   added: (at p0 l3-1)
   goals met: 5 of 5
